benchmark/gatling/src/test/resources/bodies/6k.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><logHeader xmlns="http://xmlns.skjolber.github.com/schema/logger"><userId>userId</userId><sessionId>[*****]</sessionId></logHeader></soap:Header><soap:Body><log:performLogMessageRequest xmlns:log="http://xmlns.skjolber.github.com/schema/logger"><ns:ShippingGuideResponse xmlns:ns="http://www.bring.no/logistics/shippingguide/1.0"><ns:Packages><ns:Package packageId=""><ns:Product><ns:ProductId>SERVICEPAKKE</ns:ProductId><ns:ProductCodeInProductionSystem>1202</ns:ProductCodeInProductionSystem><ns:GuiInformation><ns:SortOrder>11</ns:SortOrder><ns:MainDisplayCategory>Hent varene selv</ns:MainDisplayCategory><ns:SubDisplayCategory/><ns:DisplayName>På posten</ns:DisplayName><ns:ProductName>Klimanøytral Servicepakke</ns:ProductName><ns:DescriptionText>Rimi Jessheim. Åpningstider Man - Fre: 0700-2300, Lør: 0900-2100</ns:DescriptionText><ns:HelpText>Sendingen er en Klimanøytral Servicepakke som blir levert til mottakers postkontor/ post i butikk. Mottaker kan velge å hente sendingen på et annet postkontor/post i butikk enn sitt lokale. Mottaker varsles om at sendingen er ankommet via SMS, e-post eller hentemelding i postkassen. Transporttid er normalt 1-3 virkedager, avhengig av strekning. Sendingen kan spores ved hjelp av sporingsnummeret.</ns:HelpText><ns:Tip>Minst miljøbelastende!</ns:Tip><ns:MaxWeightInKgs>35</ns:MaxWeightInKgs></ns:GuiInformation><ns:Price currencyIdentificationCode="NOK"><ns:PackagePriceWithoutAdditionalServices><ns:AmountWithoutVAT>79.00</ns:AmountWithoutVAT><ns:VAT>19.75</ns:VAT><ns:AmountWithVAT>98.75</ns:AmountWithVAT></ns:PackagePriceWithoutAdditionalServices><ns:PackagePriceWithAdditionalServices><ns:AmountWithoutVAT>79.00</ns:AmountWithoutVAT><ns:VAT>19.75</ns:VAT><ns:AmountWithVAT>98.75</ns:AmountWithVAT></ns:PackagePriceWithAdditionalServices></ns:Price><ns:ExpectedDelivery><ns:WorkingDays>1</ns:WorkingDays><ns:UserMessage/><ns:FormattedExpectedDeliveryDate>19.02.2015</ns:FormattedExpectedDeliveryDate><ns:ExpectedDeliveryDate><ns:Year>2015</ns:Year><ns:Month>2</ns:Month><ns:Day>19</ns:Day></ns:ExpectedDeliveryDate><ns:AlternativeDeliveryDates/></ns:ExpectedDelivery></ns:Product><ns:Product><ns:ProductId>A-POST</ns:ProductId><ns:ProductCodeInProductionSystem/><ns:GuiInformation><ns:SortOrder>32</ns:SortOrder><ns:MainDisplayCategory>Få varene levert</ns:MainDisplayCategory><ns:SubDisplayCategory>Under 2 kilo</ns:SubDisplayCategory><ns:DisplayName>I postkassen (A-Prioritert)</ns:DisplayName><ns:ProductName>A-Prioritert</ns:ProductName><ns:DescriptionText>Sendingene får plass i en vanlig postkasse</ns:DescriptionText><ns:HelpText>Brev leveres direkte i mottakerens postkasse. Hvis brevet er for stort, må det hentes på mottakers lokale postkontor/ post i butikk innen 3 uker. Mottaker får beskjed om dette via hentemelding i postkassen. Sendingen blir sendt som A-Prioritert, og normal transporttid er 1 virkedag. Brev kan ikke spores.</ns:HelpText><ns:Tip/><ns:MaxWeightInKgs>2</ns:MaxWeightInKgs></ns:GuiInformation><ns:Price currencyIdentificationCode="NOK"><ns:PackagePriceWithoutAdditionalServices><ns:AmountWithoutVAT>48.80</ns:AmountWithoutVAT><ns:VAT>12.20</ns:VAT><ns:AmountWithVAT>61.00</ns:AmountWithVAT></ns:PackagePriceWithoutAdditionalServices><ns:PackagePriceWithAdditionalServices><ns:AmountWithoutVAT>48.80</ns:AmountWithoutVAT><ns:VAT>12.20</ns:VAT><ns:AmountWithVAT>61.00</ns:AmountWithVAT></ns:PackagePriceWithAdditionalServices></ns:Price><ns:ExpectedDelivery><ns:WorkingDays/><ns:UserMessage>Ingen fremsendingstidsgaranti for oppgitt tilpostnummer.</ns:UserMessage><ns:FormattedExpectedDeliveryDate/><ns:FormattedEarliestPickupDate/></ns:ExpectedDelivery></ns:Product><ns:Product><ns:ProductId>B-POST</ns:ProductId><ns:ProductCodeInProductionSystem/><ns:GuiInformation><ns:SortOrder>33</ns:SortOrder><ns:MainDisplayCategory>Få varene levert</ns:MainDisplayCategory><ns:SubDisplayCategory>Under 2 kilo</ns:SubDisplayCategory><ns:DisplayName>I postkassen (B-Økonomi)</ns:DisplayName><ns:ProductName>B-Økonomi</ns:ProductName><ns:DescriptionText>Sendingene får plass i en vanlig postkasse</ns:DescriptionText><ns:HelpText>Brev leveres direkte i mottakerens postkasse. Hvis brevet er for stort, må det hentes på mottakers lokale postkontor/ post i butikk innen 3 uker. Mottaker får beskjed om dette via hentemelding i postkassen. Sendingen blir sendt som B-Økonomi, og normal transporttid er 3-5 virkedager. Brev kan ikke spores.</ns:HelpText><ns:Tip>Billigst!</ns:Tip><ns:MaxWeightInKgs>2</ns:MaxWeightInKgs></ns:GuiInformation><ns:Price currencyIdentificationCode="NOK"><ns:PackagePriceWithoutAdditionalServices><ns:AmountWithoutVAT>44.00</ns:AmountWithoutVAT><ns:VAT>11.00</ns:VAT><ns:AmountWithVAT>55.00</ns:AmountWithVAT></ns:PackagePriceWithoutAdditionalServices><ns:PackagePriceWithAdditionalServices><ns:AmountWithoutVAT>44.00</ns:AmountWithoutVAT><ns:VAT>11.00</ns:VAT><ns:AmountWithVAT>55.00</ns:AmountWithVAT></ns:PackagePriceWithAdditionalServices></ns:Price><ns:ExpectedDelivery><ns:WorkingDays>3</ns:WorkingDays><ns:UserMessage/><ns:FormattedExpectedDeliveryDate>23.02.2015</ns:FormattedExpectedDeliveryDate><ns:ExpectedDeliveryDate><ns:Year>2015</ns:Year><ns:Month>2</ns:Month><ns:Day>23</ns:Day></ns:ExpectedDeliveryDate><ns:AlternativeDeliveryDates/></ns:ExpectedDelivery></ns:Product></ns:Package></ns:Packages><ns:TraceMessages><ns:Message>Length, Width and Height is required for exact price calculation for product A-POST</ns:Message><ns:Message>Length, Width and Height is required for exact price calculation for product B-POST</ns:Message><ns:Message>Added fee 'brev-varsling' (NOK 7.00) to base price of SERVICEPAKKE since request did not have additional service 'eVarsling' specified.</ns:Message></ns:TraceMessages></ns:ShippingGuideResponse></log:performLogMessageRequest></soap:Body></soap:Envelope>