benchmark/gatling/src/test/resources/bodies/1k.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><logHeader xmlns="http://xmlns.skjolber.github.com/schema/logger"><userId>userId</userId><sessionId>[*****]</sessionId></logHeader></soap:Header><soap:Body><log:performLogMessageRequest xmlns:log="http://xmlns.skjolber.github.com/schema/logger"><samlp:Response xmlns:samlp="urn:oasis:names:tc:SAML:2.0:protocol">value</samlp:Response></log:performLogMessageRequest></soap:Body></soap:Envelope>